docs/evidence/perf/sweep-win-pool-20.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /perf/load.js
        output: -

     scenarios: (100.00%) 2 scenarios, 55 max VUs, 1m40s max duration (incl. graceful stop):
              * warmup: 5 looping VUs for 20s (exec: traffic, gracefulStop: 30s)
              * measure: 50 looping VUs for 45s (exec: traffic, startTime: 25s, gracefulStop: 30s)


Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

Run       [ 100% ] setup()
warmup    [   0% ]
measure   [   0% ]

running (0m07.0s), 05/55 VUs, 15 complete and 0 interrupted iterations
warmup    [   3% ] 5 VUs    00.6s/20s
measure • [   0% ] waiting  24.4s

running (0m08.0s), 05/55 VUs, 50 complete and 0 interrupted iterations
warmup    [   8% ] 5 VUs    01.6s/20s
measure • [   0% ] waiting  23.4s

running (0m09.0s), 05/55 VUs, 85 complete and 0 interrupted iterations
warmup    [  13% ] 5 VUs    02.6s/20s
measure • [   0% ] waiting  22.4s

running (0m10.0s), 05/55 VUs, 120 complete and 0 interrupted iterations
warmup    [  18% ] 5 VUs    03.6s/20s
measure • [   0% ] waiting  21.4s

running (0m11.0s), 05/55 VUs, 160 complete and 0 interrupted iterations
warmup    [  23% ] 5 VUs    04.6s/20s
measure • [   0% ] waiting  20.4s

running (0m12.0s), 05/55 VUs, 195 complete and 0 interrupted iterations
warmup    [  28% ] 5 VUs    05.6s/20s
measure • [   0% ] waiting  19.4s

running (0m13.0s), 05/55 VUs, 235 complete and 0 interrupted iterations
warmup    [  33% ] 5 VUs    06.6s/20s
measure • [   0% ] waiting  18.4s

running (0m14.0s), 05/55 VUs, 275 complete and 0 interrupted iterations
warmup    [  38% ] 5 VUs    07.6s/20s
measure • [   0% ] waiting  17.4s

running (0m15.0s), 05/55 VUs, 318 complete and 0 interrupted iterations
warmup    [  43% ] 5 VUs    08.6s/20s
measure • [   0% ] waiting  16.4s

running (0m16.0s), 05/55 VUs, 360 complete and 0 interrupted iterations
warmup    [  48% ] 5 VUs    09.6s/20s
measure • [   0% ] waiting  15.4s

running (0m17.0s), 05/55 VUs, 400 complete and 0 interrupted iterations
warmup    [  53% ] 5 VUs    10.6s/20s
measure • [   0% ] waiting  14.4s

running (0m18.0s), 05/55 VUs, 440 complete and 0 interrupted iterations
warmup    [  58% ] 5 VUs    11.6s/20s
measure • [   0% ] waiting  13.4s

running (0m19.0s), 05/55 VUs, 480 complete and 0 interrupted iterations
warmup    [  63% ] 5 VUs    12.6s/20s
measure • [   0% ] waiting  12.4s

running (0m20.0s), 05/55 VUs, 525 complete and 0 interrupted iterations
warmup    [  68% ] 5 VUs    13.6s/20s
measure • [   0% ] waiting  11.4s

running (0m21.0s), 05/55 VUs, 565 complete and 0 interrupted iterations
warmup    [  73% ] 5 VUs    14.6s/20s
measure • [   0% ] waiting  10.4s

running (0m22.0s), 05/55 VUs, 610 complete and 0 interrupted iterations
warmup    [  78% ] 5 VUs    15.6s/20s
measure • [   0% ] waiting  09.4s

running (0m23.0s), 05/55 VUs, 650 complete and 0 interrupted iterations
warmup    [  83% ] 5 VUs    16.6s/20s
measure • [   0% ] waiting  08.4s

running (0m24.0s), 05/55 VUs, 695 complete and 0 interrupted iterations
warmup    [  88% ] 5 VUs    17.6s/20s
measure • [   0% ] waiting  07.4s

running (0m25.0s), 05/55 VUs, 735 complete and 0 interrupted iterations
warmup    [  93% ] 5 VUs    18.6s/20s
measure • [   0% ] waiting  06.4s

running (0m26.0s), 05/55 VUs, 775 complete and 0 interrupted iterations
warmup    [  98% ] 5 VUs    19.6s/20s
measure • [   0% ] waiting  05.4s

running (0m27.0s), 00/55 VUs, 800 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  04.4s

running (0m28.0s), 00/55 VUs, 800 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  03.4s

running (0m29.0s), 00/55 VUs, 800 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  02.4s

running (0m30.0s), 00/55 VUs, 800 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  01.4s

running (0m31.0s), 00/55 VUs, 800 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs    20s
measure • [   0% ] waiting  00.4s

running (0m32.0s), 50/55 VUs, 903 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [   1% ] 50 VUs  00.6s/45s

running (0m33.0s), 50/55 VUs, 1205 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [   3% ] 50 VUs  01.5s/45s

running (0m34.0s), 50/55 VUs, 1545 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [   6% ] 50 VUs  02.5s/45s

running (0m35.0s), 50/55 VUs, 1892 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [   8% ] 50 VUs  03.6s/45s

running (0m36.0s), 50/55 VUs, 2260 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  10% ] 50 VUs  04.5s/45s

running (0m37.0s), 50/55 VUs, 2633 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  12% ] 50 VUs  05.6s/45s

running (0m38.0s), 50/55 VUs, 3003 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  15% ] 50 VUs  06.6s/45s

running (0m39.0s), 50/55 VUs, 3387 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  17% ] 50 VUs  07.6s/45s

running (0m40.0s), 50/55 VUs, 3770 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  19% ] 50 VUs  08.6s/45s

running (0m41.0s), 50/55 VUs, 4164 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  21% ] 50 VUs  09.6s/45s

running (0m42.0s), 50/55 VUs, 4491 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  23% ] 50 VUs  10.6s/45s

running (0m43.0s), 50/55 VUs, 4887 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  26% ] 50 VUs  11.6s/45s

running (0m44.0s), 50/55 VUs, 5307 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  28% ] 50 VUs  12.6s/45s

running (0m45.0s), 50/55 VUs, 5730 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  30% ] 50 VUs  13.6s/45s

running (0m46.0s), 50/55 VUs, 6123 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  32% ] 50 VUs  14.6s/45s

running (0m47.0s), 50/55 VUs, 6555 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  35% ] 50 VUs  15.6s/45s

running (0m48.0s), 50/55 VUs, 6990 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  37% ] 50 VUs  16.6s/45s

running (0m49.0s), 50/55 VUs, 7416 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  39% ] 50 VUs  17.6s/45s

running (0m50.0s), 50/55 VUs, 7835 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  41% ] 50 VUs  18.5s/45s

running (0m51.0s), 50/55 VUs, 8265 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  43% ] 50 VUs  19.6s/45s

running (0m52.0s), 50/55 VUs, 8702 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  46% ] 50 VUs  20.5s/45s

running (0m53.0s), 50/55 VUs, 9142 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  48% ] 50 VUs  21.6s/45s

running (0m54.0s), 50/55 VUs, 9581 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  50% ] 50 VUs  22.6s/45s

running (0m55.0s), 50/55 VUs, 10029 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  52% ] 50 VUs  23.6s/45s

running (0m56.0s), 50/55 VUs, 10465 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  55% ] 50 VUs  24.6s/45s

running (0m57.0s), 50/55 VUs, 10905 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  57% ] 50 VUs  25.6s/45s

running (0m58.0s), 50/55 VUs, 11341 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  59% ] 50 VUs  26.6s/45s

running (0m59.0s), 50/55 VUs, 11785 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  61% ] 50 VUs  27.6s/45s

running (1m00.0s), 50/55 VUs, 12219 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  63% ] 50 VUs  28.5s/45s

running (1m01.0s), 50/55 VUs, 12616 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  66% ] 50 VUs  29.6s/45s

running (1m02.0s), 50/55 VUs, 13054 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  68% ] 50 VUs  30.6s/45s

running (1m03.0s), 50/55 VUs, 13478 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  70% ] 50 VUs  31.6s/45s

running (1m04.0s), 50/55 VUs, 13896 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  72% ] 50 VUs  32.6s/45s

running (1m05.0s), 50/55 VUs, 14330 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  75% ] 50 VUs  33.6s/45s

running (1m06.0s), 50/55 VUs, 14773 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  77% ] 50 VUs  34.5s/45s

running (1m07.0s), 50/55 VUs, 15218 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  79% ] 50 VUs  35.5s/45s

running (1m08.0s), 50/55 VUs, 15656 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  81% ] 50 VUs  36.6s/45s

running (1m09.0s), 50/55 VUs, 16097 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  83% ] 50 VUs  37.6s/45s

running (1m10.0s), 50/55 VUs, 16540 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  86% ] 50 VUs  38.6s/45s

running (1m11.0s), 50/55 VUs, 16969 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  88% ] 50 VUs  39.5s/45s

running (1m12.0s), 50/55 VUs, 17413 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  90% ] 50 VUs  40.6s/45s

running (1m13.0s), 50/55 VUs, 17856 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  92% ] 50 VUs  41.6s/45s

running (1m14.0s), 50/55 VUs, 18268 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  95% ] 50 VUs  42.5s/45s

running (1m15.0s), 50/55 VUs, 18687 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  97% ] 50 VUs  43.6s/45s

running (1m16.0s), 50/55 VUs, 19069 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure   [  99% ] 50 VUs  44.6s/45s


  █ THRESHOLDS 

    checks{phase:measure}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{phase:measure}
    ✓ 'p(95)<500' p(95)=14.82ms

    http_req_failed{phase:measure}
    ✗ 'rate<0.01' rate=1.00%


  █ TOTAL RESULTS 

    checks_total.......: 154560  2019.404532/s
    checks_succeeded...: 100.00% 154560 out of 154560
    checks_failed......: 0.00%   0 out of 154560

    ✓ list 200
    ✓ list 비어있지 않음
    ✓ orders 200
    ✓ orders 인증됨
    ✓ orders 최소 건수
    ✓ order 처리됨

    CUSTOM
    resp_2xx.......................: 76637 1001.301146/s
    resp_409_conflict..............: 743   9.707671/s
    resp_error_coded...............: 743   9.707671/s
    setup_requests.................: 100   1.306551/s

    HTTP
    http_req_duration..............: avg=5.19ms   min=70.8µs   med=3.24ms   p(95)=14.91ms  p(99)=30.05ms  max=299.06ms
      { expected_response:true }...: avg=5.14ms   min=70.8µs   med=3.2ms    p(95)=14.78ms  p(99)=29.58ms  max=299.06ms
      { phase:measure }............: avg=5.07ms   min=70.8µs   med=3.16ms   p(95)=14.82ms  p(99)=29.02ms  max=132.35ms
    http_req_failed................: 0.96% 743 out of 77380
      { phase:measure }............: 1.00% 743 out of 74080
    http_reqs......................: 77380 1011.008817/s

    EXECUTION
    iteration_duration.............: avg=121.78ms min=107.14ms med=115.93ms p(95)=151.52ms p(99)=188.22ms max=330ms   
    iterations.....................: 19320 252.425567/s
    vus............................: 50    min=0            max=50
    vus_max........................: 55    min=55           max=55

    NETWORK
    data_received..................: 81 MB 1.1 MB/s
    data_sent......................: 16 MB 214 kB/s



running (1m16.5s), 00/55 VUs, 19320 complete and 0 interrupted iterations
warmup  ✓ [ 100% ] 5 VUs   20s
measure ✓ [ 100% ] 50 VUs  45s
time="2026-08-08T06:56:15Z" level=error msg="thresholds on metrics 'http_req_failed{phase:measure}' have been crossed"